Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/travel_abroad/vaccinations_health_tips.html.txt.tmx
Source language: en
Languages: ga

source: Travelling abroad and vaccinations
ga: Taisteal thar lear agus vacsainiú

source: If you normally live in Ireland and are travelling abroad, you should check whether you require vaccinations in order to travel to the country or countries you intend to visit
ga: Má bhíonn gnáthchónaí ort in Éirinn agus go bhfuil tú ag taisteal thar lear, ba chóir duit seiceáil an dteastaíonn vacsaíniú uait chun taisteal go dtí an tír nó na tíortha a bhfuil sé ar intinn agat cuairt a thabhairt orthu

source: Vaccines should be considered if you are travelling to areas outside of Western Europe, North America, Australia, and New Zealand
ga: Ba chóir smaoineamh ar vacsaíní má tá tú ag taisteal go dtí ceantair lasmuigh d’Iarthar na hEorpa, Meiriceá Thuaidh, an Astráil agus an Nua-Shéalainn

source: Health risks vary from country to country, so seek advice from your family doctor (GP), Health Service Executive (HSE) or travel agent in advance of travel
ga: Tá priacail sláinte éagsúla ann ó thír go chéile, mar sin ba chóir duit comhairle a lorg ó do dhochtúir teaghlaigh (GP), Limistéar Fheidhmeannacht na Seirbhíse Sláinte (FSS) nó gníomhaireacht taistil roimh thaisteal duit

source: The World Health Organisation Country List provides some information
ga: Soláthraíonn Liosta Tíortha de chuid an Eagraíocht Dhomhanda Sláinte an t-eolas seo

source: Some vaccinations take time to become effective so give yourself at least 8 weeks to protect yourself fully
ga: Tá tús luath leis an bpróiséas fíor-thábhachtach má tá sé ar intinn agat taisteal le páistí

source: The BCG vaccination against tuberculosis (TB), for example, should be given at least 3 months before your child travels
ga: Ba cheart an vacsainiú BCG i gcoinne an eitinn, mar shampla, a bheith tugtha ar a laghad 3 mhí sula bhfuil do ghasúr chun fágáil

source: The HSE has information on the different types of vaccines, such as for cholera or for tuberculosis, on its website
ga: Tá eolas ag FSS ar na cineálacha éagsúla de vacsaíní ar a láithreán gréasáin, mar shampla le haghaidh calar nó le haghaidh eitinn

source: Certain vaccinations are compulsory
ga: Tá roinnt vacsainiúnna éigeantach

source: In these cases, you will need to show an International Certificate of Vaccination in order to gain access to the country in question
ga: Sa chás seo, beidh ort Teastas Idirnáisiúnta Vacsainiú a thaispeáint chun gur féidir leat dul isteach sa tír áirithe sin. Tá vacsainiúnna eile a mholtar ach go bhfágtar an cinneadh fút féin

source: Other vaccinations are recommended and the decision is left to your own discretion, however, it makes sense to do everything you can to guard against illness and disease while you are away
ga: Is ciallmhar an rud é, áfach, gach rud is féidir leat a dhéanamh chun cosaint i gcoinne tinneas agus galar chomh fada is atá tú imithe

source: If you feel ill following your return to Ireland, make sure that you see a doctor as soon as possible
ga: Má mhothaíonn tú tinn tar éis duit teacht ar ais go hÉirinn, déan cinnte go bhfeiceann tú dochtúir chomh luath agus is féidir

source: Give full details of the countries you visited, in case this should be relevant
ga: Tabhair sonraí iomlána de na tíortha ar thug tú cuairt orthu, ar fhaitíos go mbeadh sé seo ábhartha

source: The law in Ireland makes special provision regarding the reporting of infectious diseases to the national Health Protection Surveillance Centre
ga: Déanann an dlí in Éirinn soláthar speisialta maidir le tuairisciú galar tógálach chuig an Lárionad Faire um Chosaint Sláinte náisiúnta

source: As soon as a medical practitioner in Ireland becomes aware of, or suspects that a person they are attending is suffering from, or is the carrier of an infectious disease, they are required to transmit a written or electronic notification to a Medical Officer of Health
ga: Chomh luath agus is eol do chleachtóir leighis nó go bhfuil amhras orthu go bhfuil an duine ar a bhfuil siad ag freastal ag fulaingt nó ag iompar galair thógálaigh, ní mór dóibh fógra scríofa nó leictreonach a sheoladh chuig Oifigeach Leighis um Shláinte

source: Notification of infectious diseases is necessary in order to control infectious diseases
ga: Ní mór fógra a thabhairt i leith galair thógálacha chun galair thógálacha a smachtú

source: Ireland's Health Protection Surveillance Centre works in partnership with health service providers and organisations in other countries to ensure that up to date information is available to contribute to the effective control of infectious diseases
ga: Oibríonn Lárionad Faire um Chosaint Sláinte na hÉireann i gcomhpháirt le soláthróirí seirbhísí sláinte agus le heagraíochtaí i dtíortha eile chun a chinntiú go bhfuil eolas suas chun dáta ar fáil chun cur le smachtú éifeachtúil na ngalar tógálach

source: You will not need vaccinations in order to visit any European country, unless you have visited a non-European country shortly beforehand. Make sure that you record your vaccinations on an International Vaccination Certificate
ga: Ní bheidh aon vacsaniú ag teastáil uait chun cuairt a thabhairt ar aon tír Eorpach, muna bhfuil tú tar éis cuairt a thabhairt ar thír taobh amuigh den Eoraip go gairid roimhe

source: Health risks vary from country to country so seek advice from your family doctor, HSE or travel agent in advance
ga: Tá priacail sláinte éagsúla ann ó thír go chéile, mar sin ba chóir duit comhairle a lorg ó do dhochtúir teaghlaigh, FSS nó gníomhaireacht taistil roimh thaisteal duit

source: Travel vaccinations are not free in Ireland through the public health system - even if you hold a medical card
ga: Ní bhíonn vacsaínithe ar fáil saor in aisce in Éirinn tríd an gcóras sláinte poiblí - fiú má tá cárta leighis agat

source: You will have to pay the full cost for vaccinations
ga: Beidh ort na costais iomlána a íoc le haghaidh vacsaínithe

source: A charge will usually be made for your visit to the doctor and in addition, you will have to pay for each vaccine or set of tablets prescribed
ga: Gearrfar táille ort i leith do chuairte ar an dochtúir agus chomh maith leis sin, beidh ort íoc as gach vacsaín nó foireann táblaí a ordaítear
